
//===================================================================
//テクスチャ管理
//
//===================================================================
#pragma once

#ifndef TEXTURE_H_

#define	TEXTURE_H_

#include	"znoTouch_renderer.h"

//===================================================================
//テクスチャのロード
//in	テクスチャファイル名の先頭ポインタ
//
int		LoadTexture(char*	filename);

//===================================================================
//テクスチャの終了処理
//ロード済のテクスチャを全て解放
void	UninitTexture();

//===================================================================
//指定のテクスチャ情報を取得
//in	使用したいテクスチャハンドル
//
ID3D11ShaderResourceView**	GetTexture(int	index);

#endif // !TEXTURE_H_
